app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @products = Product.all

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_product
      @product = Product.find(params[:id])