app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews"
---
  def index
    @reviews = Review.all

INSERT INTO "reviews" ("title", "content", "author", "created_at", "updated_at", "product_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @review = Review.new(review_params)

    if @review.save

UPDATE "reviews" SET "title" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["title", "Bageera"], ["updated_at", "2021-02-25 02:56:52.603170"], ["id", 4]]
---
  def update
    if @review.update(review_params)

DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 4]]
---
  def destroy
    @review.destroy

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_review
      @review = Review.find(params[:id])