app/controllers/reviews_controller.rb

  def index
    reviews = Review.where(product_id: params[:product_id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = $1  [["product_id", 1]]